# ActualTreadDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..ActualTreadDepth Property
Stairs Class See Also
---
The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ActualTreadDepth { get; set; }
```

Visual Basic
---
```text
Public Property ActualTreadDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ActualTreadDepth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet. |

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace